app/Http/Controllers/CreateController.php

insert into `to_dos` (`user_id`, `title`, `description`, `deadline`, `status`, `updated_at`, `created_at`) values (1, 'berbuka', 'beli jajan yang manis-manis', '2025-12-14 00:00:00', 'pending', '2025-12-13 13:08:40', '2025-12-13 13:08:40')
---
    public function store(Request $request){
        $request->validate([
            'title' => 'required|max:255',
            'description' => 'nullable|max:1000',
            'deadline' => 'nullable|date|after_or_equal:today',
        ], [
            'title.required' => 'Judul todo wajib diisi',
            'title.max' => 'Judul maksimal 255 karakter',
            'description.max' => 'Deskripsi maksimal 1000 karakter',
            'deadline.date' => 'Format tanggal tidak valid',
            'deadline.after_or_equal' => 'Tanggal tidak boleh kurang dari hari ini',
        ]);

        ToDo::create([
            'user_id' => Auth::id(),
            'title' => $request->title,
            'description' => $request->description,
            'deadline' => $request->deadline,
            'status' => 'pending',
        ]);