app/Http/Controllers/DeleteController.php

delete from `to_dos` where `id` = 5
---
     public function destroy(ToDo $todo){
        // Pastikan user hanya bisa hapus todo miliknya
        if($todo->user_id !== Auth::id()){
            abort(403);
        }

        $todo->delete();