app/Http/Controllers/TodoController.php

select * from `to_dos` where `user_id` = 1 order by `deadline` asc
---
    public function index(Request $request){
        $query = ToDo::where('user_id', Auth::id());

        // Pencarian berdasarkan deskripsi atau title
        if($request->has('search') && $request->search != '') {
            $searchTerm = $request->search;
            $query->where(function($q) use ($searchTerm) {
                $q->where('description', 'LIKE', '%' . $searchTerm . '%')
                  ->orWhere('title', 'LIKE', '%' . $searchTerm . '%');
            });
        }

        $todos = $query->orderBy('deadline', 'asc')->get();