app/Repositories/EloquentUserRepository.php

select * from `users` where `email` = 'test@gmail.com' limit 1
---
    public function findByEmail(string $email): ?User
    {
        return User::where('email', $email)->first();

insert into `users` (`name`, `email`, `password`, `email_verified_at`, `updated_at`, `created_at`) values ('reny murni hidayati', 'test@gmail.com', '$2y$12$symoA49pf4gYVjL35w0kEe4pJvV5l3yT/BVkVX3F3dVpt8t.zqf1i', '2025-12-13 17:45:11', '2025-12-13 17:45:11', '2025-12-13 17:45:11')
---
    public function create(array $data): User
    {
        return User::create($data);